def solution(letter):
    # 영어가 싫어요와 동일할 듯?
    # replace로 바꿔줬던거 같은데
    # 이 아니라, 공백으로 단어를 나누고 morse에서 value를 찾아 가져오기
    
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    
    return ''.join([morse[word] for word in letter.split(' ')])