def solution(n):
    # 나눴을때 더이상 나눠지지 않을때 추가
    # ex) n = 12
#     12 / 2 = 6, 12 % 2 == 0 -> [2]
#     6 / 2 = 3, 6 % 2 == 0 -> [2, 2]
#     3 / 2, 3 % 2 == 1
#     3 / 3 = 1, 3 % 3 == 0 => end [2, 2, 3]
#     set([2,2,3])
    
#     420 / 2 = 210 -> [2]
#     210 / 2 = 105 -> [2,2]
#     105 / 2, 105 % 2 == 1
#     105 / 3 = 35 -> [2,2,3]
#     35 / 3, 35 % 3 == 2
#     35 / 4, 35 % 4 == 3
#     35 / 5 = 7 -> [2,2,3,5]
#     7 / 5, 7 % 5 == 2
#     7 / 6, 7 % 6 == 1
#     7 / 7 = 1, 7 % 7 == 0 => end [2,2,3,5,7]
#     set([2,2,3,5,7])
    answer = []
    i = 2
    while i <= n:
        if not n % i:
            answer.append(i)
            n = n // i
            continue
        if n // i == 1 and n % i == 0:
            answer.append(i)
            break
        i += 1
    return sorted(list(set(answer)))