def solution(a, b, n):
    answer = 0
    while n >= a:
        answer += (n//a)*b
        n = (n//a)*b + n%a
    return answer

# a=2, b=1, n=20
# 20//2*1 + 20%2 = 10 -> 남는 병 // 10 -> 받은병 
# 10//2*1 + 10%2 = 5-> 남는병 // 5 -> 받은병 
# 5//2*1 + 5%2 = 3 -> 남는병 // 2 -> 받은병 
# 3//2*1 + 3%2 = 2 -> 남는병 // 1 -> 받은병 
# 2//2*1 + 2%2 = 1 -> 남는병 // 1 -> 받은병 // 1>=2 종료

# n//a*b + n%a -> 남는 병
# n//a*b -> 받은 병

# a=3, b=1, n=20
# 20//3*1 + 20%3 = 8 -> 남는 병 // 6 -> 받은병 
# 8//3*1 + 8%3 = 4-> 남는병 // 2 -> 받은병 
# 4//3*1 + 4%3 = 2 -> 남는병 // 1 -> 받은병 
# 2//3*1 + 2%3 = 1 -> 남는병 // 0 -> 받은병 // 2>=3이므로 종료