def solution(a, b):
    answer = ''
    week = ['FRI','SAT','SUN','MON','TUE','WED','THU']
    month = {1:31, 2:29, 3:31, 4:30, 5:31, 6:30, 7:31, 8:31, 9:30, 10:31, 11:30, 12:31}
    if a-1 == 0:
        answer = week[(b - 1) % 7]
    else:
        days = 0
        for mon in range(1, a):
            days += month[mon]
        answer = week[(days + b - 1) % 7]
    return answer

# 1월 8일 계산
# a - 1 == 0
# 8 - 1 == 7
# 7 % 7 == 0 -> 금

# 1월 23일 계산
# a - 1 == 0
# 23 - 1 == 22
# 22 % 7 == 1 -> 토

# 2월 3일 계산
# a - 1 == 1 -> 31 + 3
# 34 - 1 == 33
# 33 % 7 == 5 -> 수 1월 30일 토, 31 일, 1 월, 2화, 3수

# 5월 24일 계산
# a - 1 == 4 -> 31 + 29 + 31 + 30 + 24
# 145 - 1 == 144
# 144 % 7 == 4 -> TUE